const { createInterface } = require("node:readline");

// อันดับแรกผมเรียกหน้า Interface มาก่อน
const rl = createInterface({
  input: process.stdin,
  output: process.stdout,
});

// สร้างตัวแปรที่เก็บรูปแบบของแต่ละตัวละครแล้วก็พื้นที่ เพื่อรอนำไปใช้
// ผมจะให้กำเนิด spiderman บังคับแมงมุมไปกัดปีเตอร์
const peter = "👦";
const bomb = "💥";
const fieldCharacter = "🟫";
const spider = "🕷️ ";

// ผมสร้างฟังชั่นที่สร้างแมพแบบสุ่ม
function generateField(height, width, bombPercent) {
  //==================================================================================================
  // อันนี้ผมสร้าง field เป็นcodeที่เจนแมพออกมาเป็น 🟫 ให้เต็มหน้าก่อน โดยอิงจากความสูงกับกว้าง
  // ตอนแรกผมจะให้มันสร้าง Array หลักก่อนเป็นการอิงจำนวนจาก height เป็นแถว row
  const field = Array.from({ length: height }, () =>
    // แล้วก็มีลูกๆของมันเป็ยชั้นใน โดยอิงจาก width แล้วก็ยัด fieldCharacter เข้าไปใน Array ทุกตัวที่สร้างขึ้นมาซึ่งแสดงเป็น columns
    Array.from({ length: width }, () => fieldCharacter),
  );
  // สร้างmapเสร็จแล้วจ้า (ยังมีแค่🟫เต็มกระดาน)
  //==================================================================================================

  //==================================================================================================
  // ต่อมาผมจะสุ่มผู้เล่นก่อน
  // ผมสร้างตัววแปรไว้เก็บตัวเลขในการสุ่มไว้ เอาให้ดูง่ายก็เป็นแกน X แกน Y ซึ่ง Y ก๋็เอาทศนิยมที่สุ่มได้ไปคูณกับค่่า Height X ก็คูณกับ width
  const startY = Math.floor(Math.random() * height);
  const startX = Math.floor(Math.random() * width);
  // แล้วก็เอาตัวเลขที่สุ่มได้ไปยัดใน Array ตามแกนของ field เพื่อระบุตำแหน่งใน Map แล้วกำหนดให้ spider ไปอยู่ตรงนั้น
  field[startY][startX] = spider;
  //==================================================================================================

  //==================================================================================================
  // ผมสร้างการสุ่มปีเตอร์ของผมต่อเลย แต่ต้องป้องกันไม่ให้ทับกับแมงมุม
  // ผมต้องตั้งตัวแปรเป็ร let เพื่อให้เปลี่ยนค่าได้
  let peterY, peterX;
  // ทำลูปจนกว่าปีเตอร์ของผมจะไม่ซ้ำกับแมงมุม
  // do คือให้มันสุ่มค่า x y ของปีเตอร์มาก่อน
  do {
    peterY = Math.floor(Math.random() * height);
    peterX = Math.floor(Math.random() * width);
  } while (peterY === startY && peterX === startX); // ใช้ while มาเช็กว่าปีเตอร์ x กับ y เท่ากับ x y แมงมุมไหมถ้าตรงให้หไปสุ่มมาใหม่จ้า
  // เอาพิกัดของปีเตอร์ไปวางไว้บน map แล้วยัดตัวละครปีเตอร์เข้าไป
  field[peterY][peterX] = peter;
  //==================================================================================================

  //==================================================================================================
  //สุ่มระเบิดกันครับ
  //ทำการลูปเช็คที่อยู่ของปีเตอร์กับแมงมุมก่อน ยังให้แกน y เป็นหลักเหมือนเดิมก็คือ row นั้นแหละ
  //คือให้มันเริ่มจาก Array ที่ 0 ทั้ง x และ y เลย แล้วให้อิงจากค่า height กับ widthคือน้อยกว่าก็ให้บวก 1ไแเรื่อยๆ
  for (let y = 0; y < height; y++) {
    for (let x = 0; x < width; x++) {
      const isSpider = y === startY && x === startX; //ได้เลขที่ลูปมาแล้วก็ให้มาหาตำแหน่ง คือถ้าเลขแกนมันตรงกับเลขแกนของ spider ก็ให้มันเก็บเลขนั้นไว้ในตัวแปร isSpider ไปก่อน
      const isPeter = y === peterY && x === peterX; //อันนี้ก็คือกันแค่เป็นปีเตอร์

      // ทีนี้มาเช็คอีกรอบใช้ if
      if (!isSpider && !isPeter) {
        //ถ้าเลขนั้นอะไม่ใช่ แมงมุม กับ เปอร์ตี้ให้ไปคำสั่งต่อไป
        //คือการสุ่มในบรรทัดนี้ อันนี้ผมต้องย้อนไปเพิ่มตัวแปร bombPercent ที่บรรทัด 17
        if (Math.random() < bombPercent) {
          //บรรทัดนี้อะมันคือการตั้งเปอร์เซนต์ในการสุ่มในแต่ละรอบผมตั้งให้มันอยู่ที่ 30% ก็คือ 0.3 นั้นแหละในการลูป 1 รอบ
          field[y][x] = bomb; // คือถ้ามันน้อยกว่า 0.3 ก็ให้วางระเบิดเลย คืออย่างเช่นmap มัน 5x5 - 2 เนื่องจากต้องไม่ใช่ปีเตอร์กับแมงมุมก็คือ 23 ช่องคือลูป 23 ครั้งในแต่ละช่องมีโอกาสวางระเบิด30%
        }
      }
    }
  }
  // ลูปนี้โคตรงงเลยครับเอาจริงมั่วไปหมด
  //==================================================================================================
  //ส่งออกเป็น Object
  return { field, startX, startY };
}
// จบการสร้าง map ค้าบ (น้ำตาไหลเป็นเลือด)

//==============================================================================================================
// ต่อไปสร้างฟังชั่นให้แสดง map กันครับ
// หลังจากนี้ต้องคอมเม้นน้อยลงแล้วครับกลัวไม่ทัน
const { field, startX, startY } = generateField(5, 5, 0.3); //ทำตัวแปรส่ง prop ครับ แล้วก็กำหนด map ด้วยว่ากว้างเท่าไหรแล้วก็ระเบิดกี่เปอร์เซนต์

// ตั้งที่อยู่แมงมุมหลังจากสุ่มได้ไปแสดงใน map
let spiderX = startX;
let spiderY = startY;

// ทำให้ map แสดงออกมาครับ
function printField() {
  console.clear();
  console.log("-----ไปกัดปีเตอร์กันจ้า-----");
  console.log("w (ขึ้น) | s (ลง) | a (ซ้าย) | d (ขวา)\n");

  // ใช้ for ให้ดึง row ของ array ออกมาที่ละตัว
  for (let row of field) {
    // แปลงสมาชิกในแถวนั้นๆที่เป็น Array ให้กลายเป็น String ข้อความยาวๆ โดยคั่นด้วยเว้นวรรค " "
    console.log(row.join(" "));
  }
}
//==============================================================================================================
// ได้เวลาทำการเล่นแล้วครับท่าน
function playGame() {
  //ปริ้นออก map มาก่อนค้าบ
  printField();
  //เป็นการยิงคำถามแล้วรอรับinputก่อน
  rl.question("\nเดินไปกัดเลยครับ! ( w | a | s | d ): ", (input) => {
    const move = input.trim().toLowerCase(); // ดักinputครับ ตัดหน้าหลังก่อนแล้วก็พิมพ์เล็กใหญ่ได้หมด
    field[spiderY][spiderX] = fieldCharacter; // เคลียร์รอยเท้าแมงมุมครับ แบบเดินไปแล้วแทนที่ด้วยพื้นสีน้ำตาล

    // ต่อมาผมกำหนดตัวแปลไว้เผื่อไว้คำนวนตำแหน่งใหม่ครับ
    let newX = spiderX;
    let newY = spiderY;

    // กำหนดขอบเขตต่อครับอันนี้ ใช้ if else
    if (move === "w")
      newY -= 1; // กด w แล้วลบ y ไป 1 เพื่อย้ายตำแหน่งไป array แกน y ให้ต่ำลง (ก็คือเดินขึ้นนั้นแหละ)
    else if (move === "s")
      newY += 1; // เหมือนกันครับ ให้ดูตามแกนได้เลย
    else if (move === "a") newX -= 1;
    else if (move === "d") newX += 1;
    // อันนี้ดักไว้ก่อนครับ (ใส่เอาเท่ อยากวีนเฉยๆ)
    // ถ้าinputตัวอื่นนอกเหนือจาก w a s d วีนเลย
    else {
      field[spiderY][spiderX] = spider;
      console.log("กดได้แค่ w, a, s, d เท่านั้น!!!!!!");
      // delayสักหน่อย แล้วค่อยกลับไปให้ input เหมือนเดิม
      setTimeout(playGame, 2000);
      return;
    }

    // อันนี้ผมทำให้ดึงคืนครับเอามาเทสก่อนให้เป็นตำแหน่งใหม่เรื่อยๆ
    spiderX = newX;
    spiderY = newY;

    field[spiderY][spiderX] = spider; //แมงมุมมาแสดงใหม่แล้วเล่นต่อ
    playGame();
  });
}

//test
playGame();
