const { createInterface } = require("node:readline");

// อันดับแรกผมเรียกหน้า Interface มาก่อน
const rl = createInterface({
  input: process.stdin,
  output: process.stdout,
});

// สร้างตัวแปรที่เก็บรูปแบบของแต่ละตัวละครแล้วก็พื้นที่ เพื่อรอนำไปใช้
// ผมจะให้กำเนิด spiderman บังคับแมงมุมไปกัดปีเตอร์
const peter = "👦";
const bomb = "💥";
const fieldCharacter = "🟫";
const spider = "🕷️ ";

// ผมสร้างฟังชั่นที่สร้างแมพแบบสุ่ม
function generateField(height, width, bombPercent = 0.3) {
  //==================================================================================================
  // อันนี้ผมสร้าง field เป็นcodeที่เจนแมพออกมาเป็น 🟫 ให้เต็มหน้าก่อน โดยอิงจากความสูงกับกว้าง
  // ตอนแรกผมจะให้มันสร้าง Array หลักก่อนเป็นการอิงจำนวนจาก height เป็นแถว row
  const field = Array.from({ length: height }, () =>
    // แล้วก็มีลูกๆของมันเป็ยชั้นใน โดยอิงจาก width แล้วก็ยัด fieldCharacter เข้าไปใน Array ทุกตัวที่สร้างขึ้นมาซึ่งแสดงเป็น columns
    Array.from({ length: width }, () => fieldCharacter),
  );
  // สร้างmapเสร็จแล้วจ้า (ยังมีแค่🟫เต็มกระดาน)
  //==================================================================================================

  //==================================================================================================
  // ต่อมาผมจะสุ่มผู้เล่นก่อน
  // ผมสร้างตัววแปรไว้เก็บตัวเลขในการสุ่มไว้ เอาให้ดูง่ายก็เป็นแกน X แกน Y ซึ่ง Y ก๋็เอาทศนิยมที่สุ่มได้ไปคูณกับค่่า Height X ก็คูณกับ width
  const startY = Math.floor(Math.random() * height);
  const startX = Math.floor(Math.random() * width);
  // แล้วก็เอาตัวเลขที่สุ่มได้ไปยัดใน Array ตามแกนของ field เพื่อระบุตำแหน่งใน Map แล้วกำหนดให้ spider ไปอยู่ตรงนั้น
  field[startY][startX] = spider;
  //==================================================================================================

  //==================================================================================================
  // ผมสร้างการสุ่มปีเตอร์ของผมต่อเลย แต่ต้องป้องกันไม่ให้ทับกับแมงมุม
  // ผมต้องตั้งตัวแปรเป็ร let เพื่อให้เปลี่ยนค่าได้
  let peterY, peterX;
  // ทำลูปจนกว่าปีเตอร์ของผมจะไม่ซ้ำกับแมงมุม
  // do คือให้มันสุ่มค่า x y ของปีเตอร์มาก่อน
  do {
    peterY = Math.floor(Math.random() * height);
    peterX = Math.floor(Math.random() * width);
  } while (peterY === startY && peterX === startX); // ใช้ while มาเช็กว่าปีเตอร์ x กับ y เท่ากับ x y แมงมุมไหมถ้าตรงให้หไปสุ่มมาใหม่จ้า
  // เอาพิกัดของปีเตอร์ไปวางไว้บน map แล้วยัดตัวละครปีเตอร์เข้าไป
  field[peterY][peterX] = peter;
  //==================================================================================================

  //==================================================================================================
  //สุ่มระเบิดกันครับ
  //ทำการลูปเช็คที่อยู่ของปีเตอร์กับแมงมุมก่อน ยังให้แกน y เป็นหลักเหมือนเดิมก็คือ row นั้นแหละ
  //คือให้มันเริ่มจาก Array ที่ 0 ทั้ง x และ y เลย แล้วให้อิงจากค่า height กับ widthคือน้อยกว่าก็ให้บวก 1ไแเรื่อยๆ
  for (let y = 0; y < height; y++) {
    for (let x = 0; x < width; x++) {
      const isSpider = y === startY && x === startX; //ได้เลขที่ลูปมาแล้วก็ให้มาหาตำแหน่ง คือถ้าเลขแกนมันตรงกับเลขแกนของ spider ก็ให้มันเก็บเลขนั้นไว้ในตัวแปร isSpider ไปก่อน
      const isPeter = y === peterY && x === peterX; //อันนี้ก็คือกันแค่เป็นปีเตอร์

      // ทีนี้มาเช็คอีกรอบใช้ if
      if (!isSpider && !isPeter) {
        //ถ้าเลขนั้นอะไม่ใช่ แมงมุม กับ เปอร์ตี้ให้ไปคำสั่งต่อไป
        //คือการสุ่มในบรรทัดนี้ อันนี้ผมต้องย้อนไปเพิ่มตัวแปร bombPercent ที่บรรทัด 17
        if (Math.random() < bombPercent) {
          //บรรทัดนี้อะมันคือการตั้งเปอร์เซนต์ในการสุ่มในแต่ละรอบผมตั้งให้มันอยู่ที่ 30% ก็คือ 0.3 นั้นแหละในการลูป 1 รอบ
          field[y][x] = bomb; // คือถ้ามันน้อยกว่า 0.3 ก็ให้วางระเบิดเลย คืออย่างเช่นmap มัน 5x5 - 2 เนื่องจากต้องไม่ใช่ปีเตอร์กับแมงมุมก็คือ 23 ช่องคือลูป 23 ครั้งในแต่ละช่องมีโอกาสวางระเบิด30%
        }
      }
    }
  }
  // ลูปนี้โคตรงงเลยครับเอาจริงมั่วไปหมด
  //==================================================================================================
  //ส่งออกเป็น Object
  return { field, startX, startY };
}

// test
const { field } = generateField(5, 5);
field.forEach((row) => {
  console.log(row.join(" "));
});
